name: "dc"
platform: "tensorflow_savedmodel"
default_model_filename: "model.savedmodel"
max_batch_size: 0

input: [
    { 
      name: "input_1",
      data_type: TYPE_FP32,
      dims: [-1, 260, 260, 3]

    }
]

output: [
    {
      name: "output",
      data_type: TYPE_FP32,
      dims: [-1, 3]
    }
]

# Switch to CPU instance since memory might not be enough for
# certain Models.

# Specify CPU instance.
instance_group {
  name: "dc_0",
  count: 1
  kind: KIND_CPU
}